
#Вероятности возрастов первой менструации с 7 лет. Распределение - N(12.4,1.4)
DistributionMenarche = [ 0.0002, 0.0013, 0.0123, 0.0604, 0.1778, 0.2805, 0.2694, 0.1457, 0.045, 0.0066, 0.0008 ]
ValuesMenarche= [7,8,9,10,11,12,13,14,15,16,17]

#Распределение возрастов рождения первого ребенка по пятилеткам, начиная с "до 15"
DistributionBirthsAge= [ 0.0003, 0.0399, 0.1481, 0.2138, 0.2010, 0.0873, 0.0195, 0.0014 ]
ValuesBirthsAge = [ 15, 20, 25, 30, 35, 40, 45, 50 ]

#Вероятность получить вредную мутацию. 
DistributionBRCAD = [ 0.05, 0.95 ]

#Вероятность иметь семейную историю. Куммулятивный риск рака за 2013. 
DistributionFamilyHistory = [ 0.053, 0.947 ]

#Вероятность самостоятельно сделать биопсию просто маленькая.
DistributionBiopsis = [ 0.001, 0.999 ]
DistributionHyper = [ 0.0005, 0.9995 ]


ValuesBool = [ 1, 0]

MortalityOld = [ 49.3 * 0.00001*5,  53.1 * 0.00001, 62.5 * 0.00001* 5, 82.5 * 0.00001* 5, 
                                                130.7 * 0.00001 * 5, 218.1 * 0.00001 * 5, 365.5 * 0.00001 * 5, 585.2 * 0.00001 * 5, 
                                                943.9 * 0.00001 * 5, 1502.8 * 0.00001 * 5, 2383.9 * 0.00001*5, 3883.2 * 0.00001 * 5, 
                                                6682.8 * 0.00001 * 5, 14490.8 * 0.00001 * 5 ]
#NonCancerMortality = [ 0.003745385, 0.006307324, 0.009711297, 0.012041639, 0.01541327, 0.019665832, 0.028124643, 0.044043819, 0.063622602, 0.090178453, 0.148600142, 0.247035, 0.39341802, 0.564187466 ]
Mortality = [ 0.004943, 0.008355, 0.010767, 0.013759, 0.017881, 0.024483, 0.036432, 0.053581, 0.078234, 0.113494, 0.191428, 0.307145, 0.447525, 0.616652 ]

IncidenceRussia = [ 0.819129588,    4.906092923,    14.63958975,    33.14948025,    64.51043852,    98.05953713,    125.3255884,    162.3692908,    217.9206759,    170.8025186    ,189.8030819,    155.2179934    ,141.553875,    190.1520753]
IncidenceRussiaOld = [1.0, 7.6, 26.6, 66.1 , 126.5 , 186.6,221.1, 272.1, 334.8 ,392.3, 417.8, 443.9,442.1, 410.9 ]


def GetArrayByIndex(idx, isDistr):
    if isDistr:
        if idx == 0:
            return DistributionMenarche
        elif idx == 1:
            return DistributionBirthsAge
        elif idx == 2:
            return DistributionBRCAD
        elif idx == 3:
            return DistributionFamilyHistory
        elif idx == 4:
            return DistributionBiopsis
        elif idx == 5:
            return DistributionHyper
    else:
        if idx == 0:
            return ValuesMenarche
        elif idx == 1:
            return ValuesBirthsAge
        else:
            return ValuesBool
    return None
